MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F452PETB/mcu.h
/*  Bit definition for CAN_TRG_CFG register  */
#define CAN_TRG_CFG_TTPTR_POS                          (0U)
#define CAN_TRG_CFG_TTPTR                              (0x003FU)
#define CAN_TRG_CFG_TTYPE_POS                          (8U)
#define CAN_TRG_CFG_TTYPE                              (0x0700U)
#define CAN_TRG_CFG_TTYPE_0                            (0x0100U)
#define CAN_TRG_CFG_TTYPE_1                            (0x0200U)
#define CAN_TRG_CFG_TTYPE_2                            (0x0400U)
#define CAN_TRG_CFG_TEW_POS                            (12U)
#define CAN_TRG_CFG_TEW                                (0xF000U)

/*  Bit definition for CAN_TT_TRIG register  */
#define CAN_TT_TRIG                                    (0xFFFFU)

/*  Bit definition for CAN_TT_WTRIG register  */
#define CAN_TT_WTRIG                                   (0xFFFFU)

/*******************************************************************************
                Bit definition for Peripheral CMP
*******************************************************************************/
/*  Bit definition for CMP_CTRL register  */
#define CMP_CTRL_FLTSL_POS                             (0U)
#define CMP_CTRL_FLTSL                                 (0x0007U)
#define CMP_CTRL_EDGSL_POS                             (5U)
#define CMP_CTRL_EDGSL                                 (0x0060U)
#define CMP_CTRL_EDGSL_0                               (0x0020U)
#define CMP_CTRL_EDGSL_1                               (0x0040U)
#define CMP_CTRL_IEN_POS                               (7U)
#define CMP_CTRL_IEN                                   (0x0080U)
#define CMP_CTRL_CVSEN_POS                             (8U)
#define CMP_CTRL_CVSEN                                 (0x0100U)
#define CMP_CTRL_OUTEN_POS                             (12U)
#define CMP_CTRL_OUTEN                                 (0x1000U)
#define CMP_CTRL_INV_POS                               (13U)
#define CMP_CTRL_INV                                   (0x2000U)
#define CMP_CTRL_CMPOE_POS                             (14U)
#define CMP_CTRL_CMPOE                                 (0x4000U)
#define CMP_CTRL_CMPON_POS                             (15U)
#define CMP_CTRL_CMPON                                 (0x8000U)

/*  Bit definition for CMP_VLTSEL register  */
#define CMP_VLTSEL_RVSL_POS                            (0U)
#define CMP_VLTSEL_RVSL                                (0x000FU)
#define CMP_VLTSEL_RVSL_0                              (0x0001U)
#define CMP_VLTSEL_RVSL_1                              (0x0002U)
#define CMP_VLTSEL_RVSL_2                              (0x0004U)
#define CMP_VLTSEL_RVSL_3                              (0x0008U)
#define CMP_VLTSEL_CVSL_POS                            (8U)
#define CMP_VLTSEL_CVSL                                (0x0F00U)
#define CMP_VLTSEL_CVSL_0                              (0x0100U)
#define CMP_VLTSEL_CVSL_1                              (0x0200U)
#define CMP_VLTSEL_CVSL_2                              (0x0400U)
#define CMP_VLTSEL_CVSL_3                              (0x0800U)
#define CMP_VLTSEL_C4SL_POS                            (12U)
#define CMP_VLTSEL_C4SL                                (0x7000U)
#define CMP_VLTSEL_C4SL_0                              (0x1000U)
#define CMP_VLTSEL_C4SL_1                              (0x2000U)
#define CMP_VLTSEL_C4SL_2                              (0x4000U)

/*  Bit definition for CMP_OUTMON register  */
#define CMP_OUTMON_OMON_POS                            (0U)
#define CMP_OUTMON_OMON                                (0x0001U)
#define CMP_OUTMON_CVST_POS                            (8U)
#define CMP_OUTMON_CVST                                (0x0F00U)

/*  Bit definition for CMP_CVSSTB register  */
#define CMP_CVSSTB_STB                                 (0x000FU)

/*  Bit definition for CMP_CVSPRD register  */
#define CMP_CVSPRD_PRD                                 (0x00FFU)

/*******************************************************************************
                Bit definition for Peripheral CMPCR
*******************************************************************************/
/*  Bit definition for CMPCR_DADR1 register  */
#define CMPCR_DADR1_DATA                               (0x00FFU)

/*  Bit definition for CMPCR_DADR2 register  */
#define CMPCR_DADR2_DATA                               (0x00FFU)

/*  Bit definition for CMPCR_DACR register  */
#define CMPCR_DACR_DA1EN_POS                           (0U)
#define CMPCR_DACR_DA1EN                               (0x0001U)
#define CMPCR_DACR_DA2EN_POS                           (1U)
#define CMPCR_DACR_DA2EN                               (0x0002U)

/*  Bit definition for CMPCR_RVADC register  */
#define CMPCR_RVADC_DA1SW_POS                          (0U)
#define CMPCR_RVADC_DA1SW                              (0x0001U)
#define CMPCR_RVADC_DA2SW_POS                          (1U)
#define CMPCR_RVADC_DA2SW                              (0x0002U)
#define CMPCR_RVADC_VREFSW_POS                         (4U)
#define CMPCR_RVADC_VREFSW                             (0x0010U)
#define CMPCR_RVADC_WPRT_POS                           (8U)
#define CMPCR_RVADC_WPRT                               (0xFF00U)

/*******************************************************************************
                Bit definition for Peripheral CMU
*******************************************************************************/
/*  Bit definition for CMU_PERICKSEL register  */
#define CMU_PERICKSEL_PERICKSEL                        (0x000FU)

/*  Bit definition for CMU_I2SCKSEL register  */
#define CMU_I2SCKSEL_I2S1CKSEL_POS                     (0U)
#define CMU_I2SCKSEL_I2S1CKSEL                         (0x000FU)
#define CMU_I2SCKSEL_I2S2CKSEL_POS                     (4U)
#define CMU_I2SCKSEL_I2S2CKSEL                         (0x00F0U)
#define CMU_I2SCKSEL_I2S3CKSEL_POS                     (8U)
#define CMU_I2SCKSEL_I2S3CKSEL                         (0x0F00U)
#define CMU_I2SCKSEL_I2S4CKSEL_POS                     (12U)
#define CMU_I2SCKSEL_I2S4CKSEL                         (0xF000U)

/*  Bit definition for CMU_SCFGR register  */
#define CMU_SCFGR_PCLK0S_POS                           (0U)
#define CMU_SCFGR_PCLK0S                               (0x00000007UL)
#define CMU_SCFGR_PCLK1S_POS                           (4U)
#define CMU_SCFGR_PCLK1S                               (0x00000070UL)
#define CMU_SCFGR_PCLK2S_POS                           (8U)
#define CMU_SCFGR_PCLK2S                               (0x00000700UL)
#define CMU_SCFGR_PCLK3S_POS                           (12U)
#define CMU_SCFGR_PCLK3S                               (0x00007000UL)
#define CMU_SCFGR_PCLK4S_POS                           (16U)
#define CMU_SCFGR_PCLK4S                               (0x00070000UL)
#define CMU_SCFGR_EXCKS_POS                            (20U)
#define CMU_SCFGR_EXCKS                                (0x00700000UL)
#define CMU_SCFGR_HCLKS_POS                            (24U)
#define CMU_SCFGR_HCLKS                                (0x07000000UL)

/*  Bit definition for CMU_USBCKCFGR register  */
#define CMU_USBCKCFGR_USBCKS_POS                       (4U)
#define CMU_USBCKCFGR_USBCKS                           (0xF0U)

