MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F452PETB/mcu.h
/*  Bit definition for CMU_CKSWR register  */
#define CMU_CKSWR_CKSW                                 (0x07U)

/*  Bit definition for CMU_PLLCR register  */
#define CMU_PLLCR_MPLLOFF                              (0x01U)

/*  Bit definition for CMU_UPLLCR register  */
#define CMU_UPLLCR_UPLLOFF                             (0x01U)

/*  Bit definition for CMU_XTALCR register  */
#define CMU_XTALCR_XTALSTP                             (0x01U)

/*  Bit definition for CMU_HRCCR register  */
#define CMU_HRCCR_HRCSTP                               (0x01U)

/*  Bit definition for CMU_MRCCR register  */
#define CMU_MRCCR_MRCSTP                               (0x01U)

/*  Bit definition for CMU_OSCSTBSR register  */
#define CMU_OSCSTBSR_HRCSTBF_POS                       (0U)
#define CMU_OSCSTBSR_HRCSTBF                           (0x01U)
#define CMU_OSCSTBSR_XTALSTBF_POS                      (3U)
#define CMU_OSCSTBSR_XTALSTBF                          (0x08U)
#define CMU_OSCSTBSR_MPLLSTBF_POS                      (5U)
#define CMU_OSCSTBSR_MPLLSTBF                          (0x20U)
#define CMU_OSCSTBSR_UPLLSTBF_POS                      (6U)
#define CMU_OSCSTBSR_UPLLSTBF                          (0x40U)

/*  Bit definition for CMU_MCOCFGR register  */
#define CMU_MCOCFGR_MCOSEL_POS                         (0U)
#define CMU_MCOCFGR_MCOSEL                             (0x0FU)
#define CMU_MCOCFGR_MCODIV_POS                         (4U)
#define CMU_MCOCFGR_MCODIV                             (0x70U)
#define CMU_MCOCFGR_MCOEN_POS                          (7U)
#define CMU_MCOCFGR_MCOEN                              (0x80U)

/*  Bit definition for CMU_TPIUCKCFGR register  */
#define CMU_TPIUCKCFGR_TPIUCKS_POS                     (0U)
#define CMU_TPIUCKCFGR_TPIUCKS                         (0x03U)
#define CMU_TPIUCKCFGR_TPIUCKS_0                       (0x01U)
#define CMU_TPIUCKCFGR_TPIUCKS_1                       (0x02U)
#define CMU_TPIUCKCFGR_TPIUCKOE_POS                    (7U)
#define CMU_TPIUCKCFGR_TPIUCKOE                        (0x80U)

/*  Bit definition for CMU_XTALSTDCR register  */
#define CMU_XTALSTDCR_XTALSTDIE_POS                    (0U)
#define CMU_XTALSTDCR_XTALSTDIE                        (0x01U)
#define CMU_XTALSTDCR_XTALSTDRE_POS                    (1U)
#define CMU_XTALSTDCR_XTALSTDRE                        (0x02U)
#define CMU_XTALSTDCR_XTALSTDRIS_POS                   (2U)
#define CMU_XTALSTDCR_XTALSTDRIS                       (0x04U)
#define CMU_XTALSTDCR_XTALSTDE_POS                     (7U)
#define CMU_XTALSTDCR_XTALSTDE                         (0x80U)

/*  Bit definition for CMU_XTALSTDSR register  */
#define CMU_XTALSTDSR_XTALSTDF                         (0x01U)

/*  Bit definition for CMU_MRCTRM register  */
#define CMU_MRCTRM                                     (0xFFU)

/*  Bit definition for CMU_HRCTRM register  */
#define CMU_HRCTRM                                     (0xFFU)

/*  Bit definition for CMU_XTALSTBCR register  */
#define CMU_XTALSTBCR_XTALSTB                          (0x0FU)
#define CMU_XTALSTBCR_XTALSTB_0                        (0x01U)
#define CMU_XTALSTBCR_XTALSTB_1                        (0x02U)
#define CMU_XTALSTBCR_XTALSTB_2                        (0x04U)
#define CMU_XTALSTBCR_XTALSTB_3                        (0x08U)

/*  Bit definition for CMU_PLLCFGR register  */
#define CMU_PLLCFGR_MPLLM_POS                          (0U)
#define CMU_PLLCFGR_MPLLM                              (0x0000001FUL)
#define CMU_PLLCFGR_PLLSRC_POS                         (7U)
#define CMU_PLLCFGR_PLLSRC                             (0x00000080UL)
#define CMU_PLLCFGR_MPLLN_POS                          (8U)
#define CMU_PLLCFGR_MPLLN                              (0x0001FF00UL)
#define CMU_PLLCFGR_MPLLR_POS                          (20U)
#define CMU_PLLCFGR_MPLLR                              (0x00F00000UL)
#define CMU_PLLCFGR_MPLLQ_POS                          (24U)
#define CMU_PLLCFGR_MPLLQ                              (0x0F000000UL)
#define CMU_PLLCFGR_MPLLP_POS                          (28U)
#define CMU_PLLCFGR_MPLLP                              (0xF0000000UL)

/*  Bit definition for CMU_UPLLCFGR register  */
#define CMU_UPLLCFGR_UPLLM_POS                         (0U)
#define CMU_UPLLCFGR_UPLLM                             (0x0000001FUL)
#define CMU_UPLLCFGR_UPLLN_POS                         (8U)
#define CMU_UPLLCFGR_UPLLN                             (0x0001FF00UL)
#define CMU_UPLLCFGR_UPLLR_POS                         (20U)
#define CMU_UPLLCFGR_UPLLR                             (0x00F00000UL)
#define CMU_UPLLCFGR_UPLLQ_POS                         (24U)
#define CMU_UPLLCFGR_UPLLQ                             (0x0F000000UL)
#define CMU_UPLLCFGR_UPLLP_POS                         (28U)
#define CMU_UPLLCFGR_UPLLP                             (0xF0000000UL)

/*  Bit definition for CMU_XTALCFGR register  */
#define CMU_XTALCFGR_XTALDRV_POS                       (4U)
#define CMU_XTALCFGR_XTALDRV                           (0x30U)
#define CMU_XTALCFGR_XTALDRV_0                         (0x10U)
#define CMU_XTALCFGR_XTALDRV_1                         (0x20U)
#define CMU_XTALCFGR_XTALMS_POS                        (6U)
#define CMU_XTALCFGR_XTALMS                            (0x40U)
#define CMU_XTALCFGR_SUPDRV_POS                        (7U)
#define CMU_XTALCFGR_SUPDRV                            (0x80U)

/*  Bit definition for CMU_XTAL32CR register  */
#define CMU_XTAL32CR_XTAL32STP                         (0x01U)

/*  Bit definition for CMU_XTAL32CFGR register  */
#define CMU_XTAL32CFGR_XTAL32DRV                       (0x07U)
#define CMU_XTAL32CFGR_XTAL32DRV_0                     (0x01U)
#define CMU_XTAL32CFGR_XTAL32DRV_1                     (0x02U)
#define CMU_XTAL32CFGR_XTAL32DRV_2                     (0x04U)

/*  Bit definition for CMU_XTAL32NFR register  */
#define CMU_XTAL32NFR_XTAL32NF                         (0x03U)
#define CMU_XTAL32NFR_XTAL32NF_0                       (0x01U)
#define CMU_XTAL32NFR_XTAL32NF_1                       (0x02U)

/*  Bit definition for CMU_LRCCR register  */
#define CMU_LRCCR_LRCSTP                               (0x01U)

/*  Bit definition for CMU_LRCTRM register  */
#define CMU_LRCTRM                                     (0xFFU)

